<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest Jabra Direct Setup disk image and builds a package.</string>
    <key>Identifier</key>
    <string>com.github.manuelamunoz.pkg.JabraDirectSetup</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>JabraDirectSetup</string>
        <key>SOFTWARETITLE</key>
        <string>JabraDirectSetup</string>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.manuelamunoz.download.JabraDirectSetup</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pathname%/JabraDirectSetup.pkg</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/JabraDirectSetup.pkg</string>
            </dict>
        </dict>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>pattern</key>
               <string>%RECIPE_CACHE_DIR%/downloads/unpack/*JabraDirectSetup*.pkg</string>
            </dict>
            <key>Processor</key>
            <string>FileFinder</string>
         </dict>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>destination_path</key>
               <string>%RECIPE_CACHE_DIR%/downloads/payload</string>
               <key>pkg_payload_path</key>
               <string>%found_filename%/Payload</string>
            </dict>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
         </dict>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>input_plist_path</key>
               <string>%RECIPE_CACHE_DIR%/downloads/payload/Jabra Direct.app/Contents/Info.plist</string>
               <key>plist_version_key</key>
               <string>CFBundleShortVersionString</string>
            </dict>
            <key>Processor</key>
            <string>Versioner</string>
         </dict>
         <dict>
            <key>Processor</key>
            <string>PkgCopier</string>
            <key>Arguments</key>
            <dict>
               <key>source_pkg</key>
               <string>%pathname%</string>
               <key>pkg_path</key>
               <string>%RECIPE_CACHE_DIR%/%SOFTWARETITLE%_%version%.pkg</string>
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>PathDeleter</string>
            <key>Arguments</key>
            <dict>
               <key>path_list</key>
               <array>
                  <string>%RECIPE_CACHE_DIR%/downloads/unpack</string>
                  <string>%RECIPE_CACHE_DIR%/downloads/payload</string>
               </array>
            </dict>
         </dict>
    </array>
</dict>
</plist>
