<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest SplashtopBusiness disk image.</string>
    <key>Identifier</key>
    <string>com.github.manuelamunoz.download.SplashtopBusiness</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Splashtop_Business_Mac_INSTALLER_v3.4.6.0 (1)</string>
        <key>DOWNLOAD_URL</key>
        <string>https://www.splashtop.com/downloadstart?product=stb&platform=mac-client</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array> 
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>   
                <key>input_path</key>   
                <string>%pathname%/Splashtop Business.pkg</string>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: Splashtop Inc. (CPQQ3AW49Y)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
            </dict>
        </dict>
    </array>
</dict>
</plist>
