<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest CiscoWebexMeetings disk image and builds a package.</string>
    <key>Identifier</key>
    <string>com.github.manuelamunoz.pkg.CiscoWebexMeetings</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>webexapp</string>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.manuelamunoz.download.CiscoWebexMeetings</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pathname%/%app_name%</string>
                <key>destination_path</key>
                <string>%pkgroot%/pkg/%app_name%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
