<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of CarbonCopyCloner.
    <key>Identifier</key>
    <string>com.github.manuelamunoz.download.CarbonCopyCloner</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>CarbonCopyCloner</string>
        <key>DOWNLOAD_URL</key>
        <string>https://bombich.com/software/download_ccc.php?v=latest</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>Process</key>
    <array>
     <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/CarbonCopyCloner.app</string>
                <key>requirement</key>
                <string>anchor apple generic and identifier "com.bombich.ccc" and (certificate leaf[ field.1.2.840.113549.1.1.11] /* exists */ and certificate leaf[subject.OU] = "L4F2DED5Q7")</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
