<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest Skype disk image, builds a package, and uploads to the JSS.</string>
	<key>Identifier</key>
	<string>com.github.manuelamunoz.jss.Skype</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Communication</string>
		<key>GROUP_NAME</key>
		<string>update-smart-%NAME%</string>
		<key>GROUP_TEMPLATE</key>
		<string>CFBundleVersionSmartGroupTemplate.xml</string>
		<key>NAME</key>
		<string>Skype</string>
		<key>OS_REQUIREMENTS</key>
		<string>11.x,10.16.x,10.15.x,10.14.x,10.13.x,10.12.x,10.11.x,10.10.x,10.9.x</string>
		<key>POLICY_CATEGORY</key>
		<string>Testing</string>
		<key>POLICY_TEMPLATE</key>
		<string>PolicyTemplate.xml</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>Skype ist eine Internettelefonie-Software von Microsoft. Mit Skype kann man von Computer zu Computer oder von einem Computer zu einem normalem Telefonanschluss telefonieren. VoIP (Voice over Internet Protocol) nutzt einen bestehenden Internetanschluss, um Anrufe ueber das Internet zu fuehren.</string>
		<key>SELF_SERVICE_ICON</key>
		<string>Skype.png</string>
		<key>Comment</key>
		<string>Note: PlistReader without variable injection in AutoPkg requires setting "version" input key to an empty string, as below.</string>
		<key>version</key>
		<string></string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.froegelein.pkg.Skype</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>extension_attributes</key>
				<array>
					<dict>
						<key>ext_attribute_path</key>
						<string>CFBundleVersionExtensionAttribute.xml</string>
					</dict>
				</array>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%GROUP_NAME%</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>%GROUP_TEMPLATE%</string>
					</dict>
				</array>
				<key>os_requirements</key>
				<string>%OS_REQUIREMENTS%</string>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>prod_name</key>
				<string>%NAME%</string>
				<key>self_service_description</key>
				<string>%SELF_SERVICE_DESCRIPTION%</string>
				<key>self_service_icon</key>
				<string>%SELF_SERVICE_ICON%</string>
				<key>pkg_path</key>
				<string>%pkg_path%</string>
			</dict>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
	</array>
</dict>
</plist>
